#### Terraform working directory 🏠: `demo/demo-account/demo-application/s3`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.s3_buckets.module.s3_bkt["129980683758-test-bucket-demo"].data.aws_iam_policy_document.s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "AllowAccess"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::129980683758:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "AllowSSLRequestsOnly"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.s3_buckets.module.s3_bkt["129980683758-test-bucket-demo"].aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "129980683758-test-bucket-demo"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "sec-by-def-encrypt-storage-exception" = "enabled"
        }
      + tags_all                    = {
          + "sec-by-def-encrypt-storage-exception" = "enabled"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_buckets.module.s3_bkt["129980683758-test-bucket-demo"].aws_s3_bucket_intelligent_tiering_configuration.this["Test-tiering"] will be created
  + resource "aws_s3_bucket_intelligent_tiering_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + name   = "Test-tiering"
      + status = "Enabled"

      + filter {
          + prefix = "documents/"
          + tags   = {
              + "class"    = "blue"
              + "priority" = "high"
            }
        }

      + tiering {
          + access_tier = "ARCHIVE_ACCESS"
          + days        = 125
        }
      + tiering {
          + access_tier = "DEEP_ARCHIVE_ACCESS"
          + days        = 180
        }
    }

  # module.s3_buckets.module.s3_bkt["129980683758-test-bucket-demo"].aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "abort_incomplete_multipart_upload"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }
        }
      + rule {
          + id     = "storage_class_transition"
          + status = "Enabled"

          + transition {
              + days          = 150
              + storage_class = "DEEP_ARCHIVE"
            }
          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }
      + rule {
          + id     = "current_version_expiration"
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = (known after apply)
            }
        }
      + rule {
          + id     = "noncurrent_version_storage_class_transition"
          + status = "Enabled"

          + noncurrent_version_transition {
              + storage_class = "DEEP_ARCHIVE"
            }
          + noncurrent_version_transition {
              + storage_class = "GLACIER"
            }
          + noncurrent_version_transition {
              + storage_class = "STANDARD_IA"
            }
        }
      + rule {
          + id     = "noncurrent_version_expiration"
          + status = "Enabled"

          + noncurrent_version_expiration {
              + newer_noncurrent_versions = "3"
              + noncurrent_days           = 30
            }
        }
    }

  # module.s3_buckets.module.s3_bkt["129980683758-test-bucket-demo"].aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = "129980683758-test-bucket-demo"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # module.s3_buckets.module.s3_bkt["129980683758-test-bucket-demo"].aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_buckets.module.s3_bkt["129980683758-test-bucket-demo"].aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_buckets.module.s3_bkt["129980683758-test-bucket-demo"].aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = "129980683758-test-bucket-demo"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_buckets.module.s3_bkt["129980683758-test-bucket-demo"].aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
